"""
16. 我国使用的是阶梯电价制度。按照用电的电量情况可以分为三个档次：
第一档，电量每户每月210度及以下
第二档，电量每户每月210-400度之间
第三档，电量每户每月400度以上。
一档、二档、三档就是根据不同用电量规定的电价，用电量大，电价就高，
比如第一档电量每户每月执行电价，每度0.5469元，
第二档电量每户每月在第一档电价基础上，每度加价0.05元，即每度0.5969元，
第三档电量每户每月在第一档电价基础上，每度加价0.3元，即每度0.8469元。
如：某用户一个月用电800度，则计算公式可以表达为：
电费 = 第一档用电量（210度）* 第一档电价+第二档用电量（400 - 210度）* 第二档电价+第三档用电量（800 - 400度）* 第三档电价
使用键盘输入某用户的一个月用电量，求该用户需要缴纳多少电费。
"""
kws = float(input("输入电量，单位度:"))
if kws < 210:
    price = 0.5469
    total_price = kws * price
elif kws < 401:
    price = 0.5969
    total_price = (kws - 210) * price + 210 * 0.5469
else:
    price = 0.8469
    total_price = (kws - 401) * price + 190 * 0.5969 + 210 * 0.5469
print("您需要缴电费" + str(total_price) + "元。")
