"""20. （1）假设某门面出租，在租赁合同中规定的首年租金为100000块，租金每年涨5%。在控制台打印出10年时间，每一年租金会分别涨到多少钱？
（2） 如果某打工人想租下了该店面，花费了30万进行装修，开始通过销售服装获取收入。
第一个月刨除房租、水电、人工开销，能有收入5000块。
生意越来越好做，假设能够勉强维持每月收入7%递增，那需要多久的辛勤劳动，就能收回成本？
本题中，所有金额保留两位小数。
"""
rent = 100000
for i in range(10):
    print("第" + str(i + 1) + "年租金为:", round(rent * (1 + 0.05) ** i, 2))

month = 0
money = 5000
total_money = 0
while True:
    month += 1
    total_money += money * (1 + 0.07) ** month
    if total_money >= 300000:
        break
print("需要" + str(month) + "个月,能收回成本")
